// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "Речь одного из участников диалога называется:\n",
    answer: "репликой",
    options: [
      "репликой",
      "ситуацией",
      "заметкой",
      "ремаркой"
    ]
  },
    {
    numb: 2,
    question: "Форма речи, которая характеризуется сменой высказываний двух лиц - это:",
    answer: "диалог",
    options: [
      "монолог",
      "контекст",
      "абзац",
      "диалог"
    ]
  },
    {
    numb: 3,
    question: "К элементам библиографического описания НЕ относится:",
    answer: "Содержание",
    options: [
      "Заглавие",
      "Содержание",
      "Издание",
      "Выходные данные"
    ]
  },
    {
    numb: 4,
    question: "Виды связи предложений в тексте:",
    answer: "цепная и параллельная",
    options: [
      "согласование и управление",
      "одновременная и последовательная",
      "согласование и примыкание",
      "цепная и параллельная"
    ]
  },
    {
    numb: 5,
    question: "Абзац - это ... .",
    answer: "отступ в начале строки",
    options: [
      "первое предложение текста",
      "прописная буква",
      "отступ в начале строки",
      "последнее предложение текста"
    ]
  },
  // you can uncomment the below codes and make duplicate as more as you want to add question
  // but remember you need to give the numb value serialize like 1,2,3,5,6,7,8,9.....

    {
    numb: 6,
    question: "Минимальная единица текста:",
    answer: "предложение",
    options: [
      "предложение",
      "абзац",
      "словосочетание",
      "параграф"
    ]
  },

  {
    numb: 7,
    question: "Объединенная смысловой и грамматической связью последовательность речевых единиц- это:\n",
    answer: "текст",
    options: [
      "текст",
      "монолог",
      "диалог",
      "абзац"
    ]
  },

  {
    numb: 8,
    question: "Предложение «Где изобретены индийские цифры?» относится … к плану.",
    answer: "вопросному",
    options: [
      "тезисному",
      "назывному",
      "вопросному",
      "вторичному"
    ]
  },

  {
    numb: 9,
    question: "Связь, при которой каждое последующее предложение в сложном синтаксическом целом соединено с предыдущим, называется:",
    answer: "цепной",
    options: [
      "интонационной",
      "грамматической",
      "параллельной",
      "цепной"
    ]
  },

  {
    numb: 10,
    question: "Сложное синтаксическое целое состоит из … .",
    answer: "из двух и более предложений",
    options: [
      "одного предложения",
      "из двух и более предложений",
      "только из пяти предложений",
      "только из двух предложений"
    ]
  },

  {
    numb: 11,
    question: "Какое слово является синонимом к \"светлый\"?",
    answer: "яркий",
    options: [
      "яркий",
      "темный",
      "затемненный",
      "тусклый"
    ]
  },

  {
    numb: 12,
    question: "Выберите правильное слово, чтобы завершить предложение: \"Я люблю заниматься спортом, например...\"",
    answer: "бег",
    options: [
      "спять",
      "читать",
      "гулять",
      "бег"
    ]
  },

  {
    numb: 13,
    question: "Какое слово означает \"радость\"?",
    answer: "счастье",
    options: [
      "грусть",
      "печаль",
      "счастье",
      "удовольствие"
    ]
  },

  {
    numb: 14,
    question: "Выберите правильный падеж для слова \"стол\":",
    answer: "именительный",
    options: [
      "родительный",
      "дательный",
      "творительный",
      "именительный"
    ]
  },

  {
    numb: 15,
    question: "Какое слово является противоположным к \"медленный\"?",
    answer: "быстрый",
    options: [
      "тихий",
      "громкий",
      "быстрый",
      "спокойный"
    ]
  },

  {
    numb: 16,
    question: "Выберите правильное слово, чтобы завершить предложение: \"Я люблю есть фрукты, например...\"",
    answer: "апельсин",
    options: [
      "колбасу",
      "апельсин",
      "хлеб",
      "сыр"
    ]
  },

  {
    numb: 17,
    question: "Какое слово является противоположным к \"горячий\"?",
    answer: "холодный",
    options: [
      "холодный",
      "теплый",
      "ледяной",
      "свежий"
    ]
  },

  {
    numb: 18,
    question: "Выберите правильный падеж для слова \"стол\":",
    answer: "винительный",
    options: [
      "родительный",
      "дательный",
      "творительный",
      "винительный"
    ]
  },

  {
    numb: 19,
    question: "Какое слово является синонимом к \"смех\"?",
    answer: "улыбка",
    options: [
      "грусть",
      "плач",
      "сон",
      "улыбка"
    ]
  },

  {
    numb: 20,
    question: "Выберите правильное слово, чтобы завершить предложение: \"Она выбрала книгу, чтобы...\"",
    answer: "прочитать",
    options: [
      "увидеть",
      "прочитать",
      "услышать",
      "учиться"
    ]
  },
];